// １、演算子を使って計算する
// 足し算と引き算
console.log(10 + 5);
// 数値１０に数値５を足した結果をコンソール表示しろ。
console.log(10 - 5);
// 数値１０から数値５を引いた結果をコンソールに表示しろ。

// 掛け算と割り算
console.log(10 * 5);
// 数値１０に数値５を掛けた結果をコンソール表示しろ。
console.log(10 / 5);
// 数値１０を数値５で割った結果をコンソール表示しろ。

// 整数と実数
console.log(2 + 0.5);
// 数値２に数値0.5を足した結果をコンソールに表示しろ。

//長い数式を入力する
// 同じ優先順位の演算子を組み合わせた式
console.log(2 + 10 + 5);
// 数値２に数値１０足した結果に数値５を足した結果をコンソールに表示しろ。

// 優先順位が異なる演算子を組み合わせた式
console.log(2 + 10 * 5);
// 数値１０に数値５を掛けた結果を数値２に足した結果をコンソール表示しろ。

// カッコを使って計算順を変える（グループ化）
console.log((2 + 10) * 5);
// 数値２に数値１０を足した結果を数値５を掛けた結果をコンソールに表示しろ。

// カッコの中にカッコが入れ子になった式
console.log(5 / (4 * (1 - 0.2)));
// 数値１から数値０．２を引いた結果を数値４に掛け、その結果で数値５を割った結果をコンソールに表示しろ。

// 負の数を表す「ー」
console.log(2 + 10 * -5);

//2,変数を使って計算する
// 変数を作成してその値を代入する
let moji = "ハロー！";
console.log(moji);
// 文字列「ハロー！」を新規作成した変数mojiに入れろ。
// 変数mojiの内容wpコンソールに教示しろ。

// 変数を使うメリットは？
// let price = 100;
// let taxt = price * 0.1;
// console.log(taxt);
// 数値100を新規作成した変数priceに入れろ。
// 変数priceに数値0.1を掛けた結果を新規作成しら変数taxに入れろ。
// 変数texをコンソールに表示しろ。

let price = 150;
let taxt = price * 0.1;
console.log(taxt);
// 数値150を新規作成した変数priceに入れろ。
// 変数priceに数値0.1を掛けた結果を新規作成した変数texに入れろ。
// 変数taxをコンソールに表示しろ。
